import React, { useState } from 'react';
import { Link } from "react-router-dom";
import "../OSBB/OSBB.css"
import "../Main/Main.css"
import {
    PlusIcon,
} from "@heroicons/react/24/solid";
import { Button, Typography } from '@material-tailwind/react';
const CollectionPropsForm = () => {
    const improvements = [
        {
          title: '1.Модернізація системи опалення',
          description: [
            'Провести комплексну модернізацію системи опалення, включаючи установку нових радіаторів і терморегуляторів, для підвищення енергоефективності та зниження витрат.',
            'Розглянути можливість переходу на більш економічні види палива, такі як електричне або газове опалення з високим ККД.',
          ],
        },
        {
          title: '2.Ремонт дахів та водостічних систем',
          description: [
            'Визначити пріоритетні ділянки для ремонту дахів і водостічних систем, які потребують термінового ремонту або заміни.',
            'Провести технічний огляд та очистку для усунення поточних проблем і запобігання їх виникненню в майбутньому.',
          ],
        },
        {
          title: '3.Оновлення фасаду будинку',
          description: [
            'Розглянути можливість утеплення фасаду будинку, що дозволить зменшити витрати на опалення і поліпшити загальний вигляд будівлі.',
            'Вибрати сучасні матеріали для фасадних робіт, що мають хороші теплоізоляційні властивості і довговічність.',
          ],
        },
        {
          title: '4.Покращення освітлення в під\'їздах і на території',
          description: [
            'Встановити нові енергоефективні освітлювальні прилади в під\'їздах і на прибудинковій території для підвищення безпеки і комфорту.',
            'Розглянути можливість встановлення датчиків руху для автоматичного включення освітлення.',
          ],
        },
        {
          title: '5.Облаштування дитячого майданчика',
          description: [
            'Розробити проект по облаштуванню сучасного і безпечного дитячого майданчика на території двору.',
            'Закупити меблі для вибору елементів майданчика та їх розташування.',
          ],
        },
        {
          title: '6.Організація системи збору та утилізації сміття',
          description: [
            'Встановити додаткові сміттєві контейнери для роздільного збору відходів (пластик, скло, папір).',
            'Організувати регулярні перевірки та очищення контейнерів для запобігання переповненню і неприємним запахам.',
          ],
        },
        {
          title: '7.Ремонт і модернізація ліфтів',
          description: [
            'Провести технічний огляд ліфтів, визначити їхній стан і потреби в ремонті або модернізації.',
            'Розглянути можливість заміни старих ліфтів на нові з сучасними технологічними безпечними.',
          ],
        },
        {
          title: '8.Проведення курсів і семінарів для мешканців',
          description: [
            'Організувати навчальні курси та семінари для мешканців, які можуть включати теми з енергоефективності, догляду за житлом, прав і обов\'язків в ОСББ.',
            'Запропонувати фахівців для проведення навчальних заходів.',
          ],
        },
        {
          title: '9.Встановлення системи відеоспостереження',
          description: [
            'Обговорити можливість встановлення системи відеоспостереження для підвищення рівня безпеки на території будинку.',
            'Оцінити варіанти та можливі витрати для встановлення камер.',
          ],
        },
        {
          title: '10.Поліпшення комунікацій з мешканцями',
          description: [
            'Створити ефективну систему комунікації з мешканцями, яка можлива додатково для швидкого обміну інформацією між правлінням ОСББ і мешканцями.',
            'Організувати онлайн-ресурс для інформаційної підтримки рішень правління ОСББ та прийняття рішень.',
          ],
        },
      ];
    return (
        <div>
            <div className="flex items-center ml-10 mt-5">
                <Link className='text-base text-gray-500' size='sm' style={{ fontFamily: 'Arsenal' }} to={'/'}>
                    Головна&nbsp;&nbsp;{'>'}&nbsp;&nbsp;
                </Link>
                <Link className='text-base text-gray-500' size='sm' style={{ fontFamily: 'Arsenal' }} to={'/collections'}>
                    Збори&nbsp;&nbsp;{'>'}&nbsp;&nbsp;
                </Link>
                <Link className='underline text-base text-gray-500' size='sm' style={{ fontFamily: 'Arsenal' }} to={'/collProps'}>
                    Пропозиції
                </Link>
            </div>
            <div className="mx-auto px-16 rounded-3xl">
                <div className="about-section">
                    <Typography variant='h1' style={{ color: "#A3B565", fontFamily: 'Philosopher' }}>Збори</Typography>
                </div>
                <div className='clDiv'>
                    <Typography variant='h1'>Пропозиції для зборів</Typography>
                    {improvements.map((item, index) => (
                        <div key={index} className='cellDivY'>
                            <Typography variant='h4'>{item.title}</Typography>
                            <Typography as="ul">
                                {item.description.map((desc, i) => (
                                    <Typography as="li" key={i}><PlusIcon className="h-4 w-4 d"/> {desc}</Typography>
                                ))}
                            </Typography>
                        </div>
                    ))}
                </div>
            </div>
        </div>
    )
}
export default CollectionPropsForm;